; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob70) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate1)
	(at pallet1 distributor0)
	(clear crate3)
	(at pallet2 distributor1)
	(clear crate4)
	(at truck0 distributor1)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 418)
	(at truck1 distributor0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 319)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor0)
	(on crate0 pallet1)
	(= (weight crate0) 52)
	(at crate1 depot0)
	(on crate1 pallet0)
	(= (weight crate1) 11)
	(at crate2 distributor1)
	(on crate2 pallet2)
	(= (weight crate2) 91)
	(at crate3 distributor0)
	(on crate3 crate0)
	(= (weight crate3) 54)
	(at crate4 distributor1)
	(on crate4 crate2)
	(= (weight crate4) 78)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate4)
		(on crate1 pallet0)
		(on crate3 pallet1)
		(on crate4 crate3)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (lift hoist2 crate4 crate2 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist2) (on crate4 crate2)
   added: (lifting hoist2 crate4) (clear crate2)
   changed: (fuel-cost) from 0 to 1
   goals met: 1 of 4
2. (load hoist2 crate4 truck0 distributor1)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck0) (available hoist2)
   changed: (current_load truck0) from 0 to 78
   goals met: 1 of 4
3. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 1 to 11
   goals met: 1 of 4
4. (unload hoist1 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist1)
   added: (lifting hoist1 crate4)
   changed: (current_load truck0) from 78 to 0
   goals met: 1 of 4
5. (load hoist1 crate4 truck1 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck1) (available hoist1)
   changed: (current_load truck1) from 0 to 78
   goals met: 1 of 4
6. (lift hoist1 crate3 crate0 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist1) (on crate3 crate0)
   added: (lifting hoist1 crate3) (clear crate0)
   changed: (fuel-cost) from 11 to 12
   goals met: 1 of 4
7. (load hoist1 crate3 truck1 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck1) (available hoist1)
   changed: (current_load truck1) from 78 to 132
   goals met: 1 of 4
8. (lift hoist1 crate0 pallet1 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist1) (on crate0 pallet1)
   added: (lifting hoist1 crate0) (clear pallet1)
   changed: (fuel-cost) from 12 to 13
   goals met: 1 of 4
9. (load hoist1 crate0 truck1 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck1) (available hoist1)
   changed: (current_load truck1) from 132 to 184
   goals met: 1 of 4
10. (unload hoist1 crate3 truck1 distributor0)
   deleted: (in crate3 truck1) (available hoist1)
   added: (lifting hoist1 crate3)
   changed: (current_load truck1) from 184 to 130
   goals met: 1 of 4
11. (drop hoist1 crate3 pallet1 distributor0)
   deleted: (lifting hoist1 crate3) (clear pallet1)
   added: (available hoist1) (at crate3 distributor0) (clear crate3) (on crate3 pallet1)
   goals met: 2 of 4
12. (unload hoist1 crate4 truck1 distributor0)
   deleted: (in crate4 truck1) (available hoist1)
   added: (lifting hoist1 crate4)
   changed: (current_load truck1) from 130 to 52
   goals met: 2 of 4
13. (drop hoist1 crate4 crate3 distributor0)
   deleted: (lifting hoist1 crate4) (clear crate3)
   added: (available hoist1) (at crate4 distributor0) (clear crate4) (on crate4 crate3)
   goals met: 3 of 4
14. (unload hoist1 crate0 truck1 distributor0)
   deleted: (in crate0 truck1) (available hoist1)
   added: (lifting hoist1 crate0)
   changed: (current_load truck1) from 52 to 0
   goals met: 3 of 4
15. (drop hoist1 crate0 crate4 distributor0)
   deleted: (lifting hoist1 crate0) (clear crate4)
   added: (available hoist1) (at crate0 distributor0) (clear crate0) (on crate0 crate4)
   goals met: 4 of 4
